import pandas as pd


data = [[9, 203674, 13.2, 18894],
         [11.7, 180785, 12.3, 54894],
         [10.1, 127802, 14.7, 18563],
         [11.8, 28604, 14.9, 21963],
         [13.2, 600, 13.1, 900 ],
         [6.9, 38071, 9.6, 3555 ],
         [12.1, 35660, 10.6, 9005 ],
         [12, 15000, 13, 12000],
         [11.7, 48770, 9.1, 14370],
         [9.84, 6100, 11.89, 8980 ]]

indexs = ["三重市","台中市","台北一","台北二","台東市","板橋區","高雄市","嘉義市","鳳山區","豐原區"]
cols = ["西瓜價","西瓜量","香瓜價","香瓜量"]

df = pd.DataFrame(data, index=indexs, columns=cols)
print(df)
print('-------------')
print(df.iloc[:,0].sort_values(ascending=False))
print('-------------')
print(df.loc['台北一',:])
print('-------------')
df = df.rename(index={'三重市':'三重區'},columns={'香瓜價':'洋香瓜價','香瓜量':'洋香瓜量'})
print(df)